// Курс: "Алгоритмы и структуры данных"
// Урок 3. Структуры данных. Связный список.
// Семинар

// Задание #1
// Реализуем простой односвязный список.
// Пишем только структуру, никаких методов не требуется.

public class Main
{
    public static void main(String[] args)
    {
        LinkedList linkedList = new LinkedList();
        System.out.println(linkedList);
    }
}